# -*- coding: utf-8 -*-
from flask import Flask, request, jsonify
import json
from collections import defaultdict
import random

app = Flask(__name__)

# 전체 음식 목록
all_foods = [
    "비빔밥", "한정식", "죽", "도시락", "칼국수", "비빔냉면", "밀면", "잔치국수",
    "족발", "보쌈", "구이", "돼지갈비", "닭갈비", "오리고기", "불고기", "제육볶음", "막창",
    "곱창", "대창", "치킨", "찜닭", "매운찜닭", "로제찜닭", "낙곱새", "곱창전골", "해물 전골",
    "불고기 전골", "쭈꾸미볶음", "낙지볶음", "김치찌개", "된장찌개", "순대국밥", "삼계탕",
    "갈비찜", "육개장", "떡국", "해물탕", "청국장", "감자탕", "떡볶이", "순대", "튀김",
    "쫄면", "오뎅", "김밥", "양념게장", "간장게장", "생선구이", "생선조림", "아구찜", "생선",
    "육회", "회", "물회", "짬뽕", "짜장면", "중국식볶음밥", "마파두부", "딤섬", "마라탕",
    "훠궈", "양꼬치", "피자", "햄버거", "샌드위치", "토스트", "브리또", "파스타", "로제파스타",
    "까르보나라 파스타", "스파게티", "알리올리오", "샐러드", "스테이크", "필라프", "초밥/스시",
    "유부초밥", "라멘", "덮밥", "메밀소바", "돈까스", "우동", "스키야키/샤브샤브", "카레",
    "쌀국수", "난", "똠양꿍", "팟타이", "나시고랭", "미고랭", "타코", "탕수육", "깐풍기",
    "파전", "김치전", "해물파전", "콩나물국밥", "오징어볶음", "육회비빔밥", "양장피",
    "김치볶음밥", "유산슬", "양고기", "막국수", "해물찜", "돼지국밥", "순두부찌개", "매운탕",
    "꽃게탕", "미역국", "곰탕", "설렁탕", "닭발", "불족발", "간장치킨", "소불고기", "갈치조림",
    "고등어조림", "고등어구이", "김치찜", "양념치킨", "소갈비찜", "떡갈비", "삼겹살",
    "소고기", "장어구이", "조개구이", "닭볶음탕", "내장탕", "뼈해장국", "콩국수", "알탕",
    "갈비탕", "리조또", "마제소바", "포케", "연어포케", "부대찌개", "동태찌개", "내장국밥",
    "연어덮밥", "튀김덮밥", "알밥", "떡만두국", "선지국", "두부김치", "비지찌개",
    "추어탕", "열무국수", "오리훈제", "닭칼국수", "매운등갈비", "도가니탕", "뽈찜", "황태국",
    "굴비구이", "조기구이", "폭립", "뇨끼", "오코노미야끼", "마라샹궈", "반미", "분짜", "반쎄오",
    "갈치구이", "산낙지", "장어덮밥", "버섯전골", "카츠샌도", "후토마끼", "오무라이스", "냉면"
]

# 음식 카테고리
food_categories = {
    'koreanFood': [
        "비빔밥", "한정식", "죽", "도시락", "칼국수", "비빔냉면", "밀면", "잔치국수",
        "족발", "보쌈", "구이", "돼지갈비", "닭갈비", "오리고기", "불고기", "제육볶음", "막창",
        "곱창", "대창", "치킨", "찜닭", "매운찜닭", "로제찜닭", "낙곱새", "곱창전골", "해물 전골",
        "불고기 전골", "쭈꾸미볶음", "낙지볶음", "김치찌개", "된장찌개", "순대국밥", "삼계탕",
        "갈비찜", "육개장", "떡국", "해물탕", "청국장", "감자탕", "떡볶이", "순대", "튀김",
        "쫄면", "오뎅", "김밥", "양념게장", "간장게장", "생선구이", "생선조림", "아구찜", "생선",
        "육회", "회", "물회", "로제떡볶이", "부대찌개", "동태찌개", "알밥", "떡만두국", "선지국",
        "두부김치", "비지찌개", "추어탕", "열무국수", "오리훈제", "매운등갈비", "도가니탕", "뽈찜",
        "굴비구이", "황태국", "갈치구이", "버섯전골", "파전", "김치전", "해물파전", "콩나물국밥",
        "오징어볶음", "육회비빔밥", "김치볶음밥", "해물찜", "돼지국밥", "순두부찌개", "매운탕",
        "꽃게탕", "미역국", "설렁탕", "닭발", "불족발", "간장치킨", "소불고기", "고등어조림",
        "고등어구이", "김치찜", "양념치킨", "소갈비찜", "떡갈비", "삼겹살", "소고기", "장어구이",
        "조개구이", "닭볶음탕", "내장탕", "뼈해장국", "콩국수", "알탕", "갈비탕", "내장국밥",
        "닭칼국수", "조기구이", "갈치구이", "산낙지", "막국수", "곰탕", "갈치조림", "냉면"

    ],
    'chineseFood': [
        "짬뽕", "짜장면", "중국식볶음밥", "마파두부", "딤섬", "마라탕", "훠궈", "양꼬치",
        "마라샹궈", "탕수육", "깐풍기", "양장피", "유산슬", "양고기"
    ],
    'japaneseFood': [
        "초밥/스시", "유부초밥", "라멘", "덮밥", "메밀소바", "튀김", "돈까스", "우동",
        "스키야키/샤브샤브", "카레", "장어덮밥", "연어덮밥", "텐동", "연어포케", "오코노미야끼",
        "마제소바", "포케", "튀김덮밥", "카츠샌도", "후토마끼", "오무라이스"
    ],
    'westernFood' : [
        "피자", "햄버거", "샌드위치", "토스트", "브리또", "파스타", "로제파스타", "까르보나라 파스타", "스파게티", "알리올리오", "샐러드", "스테이크", "필라프", "리조또", "뇨끼"
    ],
    'southeastAsianFood': [
        "쌀국수", "똠양꿍", "팟타이", "나시고랭", "미고랭", "반미", "분짜", "반쎄오"
    ],
    'elseFood': [
        '카레', '난', '타코'
    ],
    'meat': [
        "돼지국밥", "뼈해장국", "해장국", "설렁탕", "삼계탕", "갈비찜", "육회", "스테이크", "돈까스",
        "부대찌개", "선지국", "오리훈제", "매운등갈비", "도가니탕", "폭립", "분짜", "카츠샌도",
        "로제찜닭", "육회 비빔밥", "족발", "보쌈", "삼겹살", "목살", "두루치기", "갈비", "닭갈비",
        "오리고기", "불고기", "제육볶음", "막창", "곱창", "대창", "치킨", "찜닭", "낙곱새",
        "곱창전골", "불고기전골", "대창전골", "김치찜", "소불고기", "양념치킨", "소갈비찜", "양꼬치",
        "닭칼국수", "돼지갈비", "깐풍기", "양고기","닭발","불족발","탕수육", "간장치킨","떡갈비","돼지갈비","소고기","갈비탕","훠궈", "순대"
    ],
    'vegetable': [
        "산채비빔밥", "샌드위치", "샐러드", "포케", "연어포케", "반미", "버섯전골",
        "비빔밥",  "샤브샤브", "양장피"

    ],
    'carbohydrate': [
        "육회비빔밥", "산채비빔밥", "정식", "죽", "도시락", "칼국수", "잔치국수",
        "김치찌개", "된장찌개", "돼지국밥", "뼈해장국", "콩나물국밥", "설렁탕", "육개장",
        "떡국", "청국장", "감자탕", "떡볶이", "비빔냉면", "밀면", "쫄면", "짬뽕", "짜장면",
        "마파두부", "딤섬", "라멘", "우동", "메밀소바", "쌀국수", "팟타이", "미고랭",
        "로제파스타", "파스타", "까르보나라 파스타", "알리올리오", "콩국수", "마제소바",
        "비빔밥", "한정식", "순대국밥", "해물탕", "오뎅", "김밥", "중국식볶음밥",
        "김치볶음밥", "초밥/스시", "덮밥", "필라프", "유산슬", "해물찜", "곰탕", "미역국",
        "유부초밥", "내장탕", "알탕", "갈비탕", "리조또", "타코", "카레", "토스트", "브리또",
        "햄버거", "피자", "샌드위치", "장어덮밥", "연어덮밥", "텐동", "알밥", "떡만두국",
        "두부김치", "비지찌개", "열무국수", "오코노미야끼", "마라샹궈", "반미", "난", "반쎄오",
        "나시고랭", "닭칼국수", "순두부찌개", "튀김", "마라탕", "양장피", "오무라이스", "뇨끼", "막국수"

    ],
    'seafood': [
        "낙곱새", "해물 전골", "쭈꾸미볶음", "낙지 볶음", "해물탕", "게장",
        "생선구이", "생선조림", "아구찜", "회", "물회", "초밥/스시",
        "동태찌개", "추어탕", "뽈찜", "굴비구이", "황태국", "갈치구이", "후토마끼",
        "양념게장", "간장게장", "매운탕", "꽃게탕", "고등어조림", "장어구이",
        "조개구이", "해물찜","갈치조림","고등어구이","장어구이"
    ],
    'redFood': [
        "비빔밥", "비빔냉면", "제육볶음", "매운찜닭", "로제찜닭", "낙곱새", "곱창전골",
        "해물 전골", "쭈꾸미볶음", "낙지볶음", "김치찌개", "순두부찌개", "육개장",
        "매운탕", "떡볶이", "로제떡볶이", "양념게장", "아구찜", "김치찜",
        "김치볶음밥", "두부김치", "닭발", "불족발", "양념치킨",
        "닭볶음탕", "내장탕", "매운등갈비", "오징어볶음", "해물찜", "부대찌개", "동태찌개",
        "황태국", "마라샹궈", "짬뽕", "해물탕", "닭갈비", "꽃게탕", "쫄면",
        "마파두부", "똠양꿍", "김치전", "뼈해장국", "뽈찜","갈치조림","마라탕","깐풍기"
    ],
    'nonRedFood': [
        "한정식", "간장치킨", "로제떡볶이", "죽", "도시락", "칼국수", "밀면", "잔치국수", "족발", "보쌈", "구이", "돼지갈비", "닭갈비", "오리고기", "불고기", "막창", "곱창", "대창", "치킨", "찜닭",
        "순대국밥", "삼계탕", "갈비찜", "떡국", "감자탕", "순대", "튀김", "쫄면", "오뎅", "김밥",
        "간장게장", "생선구이", "생선조림", "생선", "육회", "회", "물회", "짜장면", "중국식볶음밥",
        "딤섬", "훠궈", "양꼬치", "피자", "햄버거", "샌드위치", "토스트", "브리또",
        "파스타", "까르보나라 파스타", "스파게티", "알리올리오", "샐러드", "스테이크", "필라프",
        "초밥/스시", "유부초밥", "라멘", "덮밥", "메밀소바", "돈까스", "우동", "스키야키/샤브샤브",
        "카레", "쌀국수", "난", "팟타이", "나시고랭", "미고랭", "타코", "탕수육","파전",
        "해물파전", "콩나물국밥", "육회비빔밥", "양장피", "된장찌개", "유산슬", "양고기", "막국수",
        "돼지국밥", "미역국", "곰탕", "설렁탕", "소불고기", "고등어조림", "고등어구이",
        "소갈비찜", "떡갈비", "삼겹살", "소고기", "장어구이", "조개구이", "콩국수", "알탕", "갈비탕",
        "리조또", "마제소바", "포케", "연어포케", "내장국밥", "연어덮밥", "튀김덮밥",
        "알밥", "떡만두국", "선지국", "추어탕", "열무국수", "오리훈제", "닭칼국수", "도가니탕",
        "굴비구이", "조기구이", "폭립", "뇨끼", "오코노미야끼", "반미", "분짜", "반쎄오", "갈치구이",
        "산낙지", "불고기전골", "후토마끼", "카츠샌도", "오무라이스", "청국장", "버섯전골", "로제파스타", "비지찌개","양고기", "냉면"

    ],
    'rice': [
        "비빔밥", "한정식", "도시락", "족발", "보쌈", "구이", "돼지갈비", "닭갈비", "오리고기",
        "불고기", "제육볶음", "막창", "곱창", "대창", "치킨", "찜닭", "매운찜닭", "로제찜닭",
        "낙곱새", "김치찌개", "된장찌개", "순대국밥", "삼계탕", "갈비찜", "육개장", "떡국",
        "해물탕", "청국장", "감자탕", "떡볶이", "순대", "오뎅", "김밥", "양념게장", "간장게장",
        "생선구이", "생선조림", "아구찜", "생선", "육회", "회", "물회", "중국식볶음밥",
        "김치볶음밥", "초밥/스시", "덮밥", "필라프", "유산슬", "콩나물국밥", "해물찜",
        "돼지국밥", "곰탕", "설렁탕", "떡갈비", "삼겹살", "소고기", "장어구이", "조개구이",
        "양장피", "미역국", "고등어조림", "갈치조림", "닭볶음탕", "유부초밥", "내장탕",
        "뼈해장국", "알탕", "갈비탕", "리조또", "추어탕", "떡만두국", "부대찌개", "동태찌개",
        "장어덮밥", "연어덮밥", "텐동", "알밥", "선지국", "두부김치", "연어포케", "비지찌개",
        "매운등갈비", "도가니탕", "굴비구이", "황태국", "갈치구이", "버섯전골", "후토마끼",
        "해물 전골", "불고기 전골", "쭈꾸미볶음", "낙지볶음", "순두부찌개", "매운탕", "꽃게탕",
        "닭발", "불족발", "간장치킨", "소불고기", "고등어구이", "김치찜", "양념치킨", "소갈비찜",
        "포케", "내장국밥", "튀김덮밥", "오리훈제", "뽈찜", "조기구이", "폭립",
        "오무라이스", "마파두부", "양꼬치","양고기","오징어볶음","육회비빔밥","돈까스", "똠양꿍","카레","스테이크"

    ],
    'bread': [
        "타코", "난", "피자", "햄버거", "샌드위치", "토스트", "브리또",
        "오코노미야끼", "반미", "카츠샌도"
    ],
    'noodle': [
        "칼국수", "비빔냉면", "밀면", "잔치국수", "쫄면", "짬뽕", "짜장면",
        "딤섬", "마라탕", "훠궈", "라멘", "우동", "메밀소바",
        "스키야키/샤브샤브", "쌀국수", "팟타이", "미고랭", "로제파스타", "까르보나라 파스타",
        "알리올리오", "콩국수", "마제소바", "열무국수", "마라샹궈", "분짜", "뇨끼", "막국수", "파스타", "스파게티", "닭칼국수", "냉면"
    ],
    'heavy': [
        "한정식", "족발", "보쌈", "돼지갈비", "닭갈비", "오리고기", "불고기", "제육볶음",
        "막창", "곱창", "대창", "치킨", "찜닭", "매운찜닭", "로제찜닭", "낙곱새", "곱창전골",
        "해물 전골", "불고기 전골", "갈비찜", "육개장", "해물탕", "감자탕", "탕수육", "깐풍기",
        "갈치조림", "고등어조림", "김치찜", "소갈비찜", "떡갈비", "삼겹살", "소고기", "장어구이",
        "조개구이", "양꼬치", "리조또", "피자", "햄버거", "스테이크", "훠궈", "회", "물회",
        "유산슬", "해물찜", "떡볶이", "로제떡볶이", "내장탕", "뼈해장국", "콩국수", "알탕",
        "갈비탕", "부대찌개", "동태찌개", "연어덮밥", "텐동", "떡만두국", "선지국", "비지찌개",
        "똠양꿍", "추어탕", "오리훈제", "매운등갈비", "도가니탕", "뽈찜", "폭립", "오코노미야끼",
        "마라샹궈", "쭈꾸미볶음", "양념게장", "간장게장", "중국식볶음밥", "돈까스", "나시고랭",
        "오징어볶음", "육회비빔밥", "양고기", "돼지국밥", "순두부찌개", "짬뽕","마파두부",
        "양념치킨", "반쎄오", "갈치구이", "산낙지", "오무라이스",
        "간장치킨", "닭칼국수", "콩나물국밥","매운탕","꽃게탕",
        "곰탕","설렁탕","닭발","불족발","소불고기","고등어구이",
        "닭볶음탕","내장국밥","김치볶음밥", "청국장","스키야키/샤브샤브","카레","필라프"

    ],
    'light': [
        "김치전", "죽", "도시락", "샐러드", "김밥", "오뎅", "초밥/스시", "샌드위치",
        "토스트", "브리또", "메밀소바", "덮밥", "쌀국수", "팟타이", "미고랭", "타코",
        "미역국", "설렁탕", "양장피", "막국수", "유부초밥", "마제소바", "잔치국수",
        "알밥", "두부김치", "포케", "연어포케", "열무국수", "굴비구이", "황태국",
        "반미", "분짜", "갈치구이", "장어덮밥", "버섯전골", "카츠샌도", "후토마끼",
        "스파게티", "딤섬","까르보나라 파스타", "해물파전", "파전", "뇨끼", "라멘",
        "우동","필라프", "냉면", "알리올리오"

    ],
    'soup': [
        "칼국수", "잔치국수", "김치찌개", "된장찌개", "순대국밥", "삼계탕", "육개장", "떡국",
        "해물탕", "청국장", "감자탕", "곱창전골", "해물 전골", "불고기 전골", "짬뽕", "마라탕",
        "훠궈", "라멘", "우동", "스키야키/샤브샤브", "똠양꿍", "콩나물국밥", "냉면",
        "밀면", "순두부찌개", "매운탕", "꽃게탕", "미역국", "곰탕", "설렁탕", "물회", "메밀소바",
        "추어탕", "돼지국밥", "닭볶음탕", "내장탕", "뼈해장국", "버섯전골", "콩국수", "알탕",
        "갈비탕", "부대찌개", "동태찌개", "떡만두국", "선지국", "비지찌개", "열무국수", "도가니탕",
        "황태국", "죽", "닭칼국수","막국수","내장국밥"

    ],
    'noSoup': [
        "비빔밥", "한정식", "도시락", "족발", "보쌈", "구이", "돼지갈비", "닭갈비",
        "오리고기", "불고기", "제육볶음", "막창", "곱창", "대창", "치킨", "찜닭", "매운찜닭",
        "로제찜닭", "낙곱새", "쭈꾸미볶음", "낙지볶음", "떡볶이", "순대", "튀김", "쫄면",
        "오뎅", "김밥", "양념게장", "간장게장", "생선구이", "생선조림", "아구찜", "생선",
        "육회", "회", "짜장면", "중국식볶음밥", "마파두부", "딤섬", "양꼬치", "피자", "햄버거",
        "샌드위치", "토스트", "브리또", "파스타", "샐러드", "스테이크", "필라프", "초밥/스시",
        "덮밥", "카레", "난", "팟타이", "나시고랭", "미고랭", "타코", "탕수육", "비빔냉면", "뇨끼",
        "깐풍기", "파전", "김치전", "해물파전", "양고기", "해물찜", "닭발", "불족발", "간장치킨",
        "소불고기", "떡갈비", "삼겹살", "소고기", "장어구이", "연어포케", "텐동", "마제소바",
        "유부초밥", "조개구이", "로제파스타", "스파게티", "알리올리오",
        "로제떡볶이", "장어덮밥", "연어덮밥", "알밥", "두부김치", "오리훈제", "매운등갈비", "뽈찜",
        "굴비구이", "폭립", "오코노미야끼", "마라샹궈", "반미", "분짜", "갈치구이", "카츠샌도",
        "후토마끼", "오무라이스", "까르보나라 파스타","갈치조림","고등어조림","김치찜","양념치킨",
        "소갈비찜","포케","오징어볶음","양장피","김치볶음밥","유산슬", "돈까스"

    ]
}

exceptional_foods = {
    '내장류': ['곱창전골', '대창전골', '막창', '곱창', '대창', '낙곱새', '선지국', '도가니탕','내장탕','내장국밥'],
    '날 것': ['회', '물회', '육회', '육회 비빔밥'],
    '해산물': ['낙곱새', '해물 전골', '쭈꾸미볶음', '낙지 볶음', '해물탕', '게장', '생선구이', '생선조림', '아구찜', '회', '육회', '물회', '초밥/스시', '해물파전', '동태찌개', '장어덮밥', '추어탕', '뽈찜', '황태국', '굴비구이', '오코노미야끼', '갈치구이', '양념게장', '간장게장', '꽃게탕', '해물찜', '짬뽕', '훠궈','매운탕','조개구이','오징어볶음','유산슬'],
    '오이': ['비빔밥'],
    '계란': ['비빔밥', '한정식', '도시락', '김밥', '파전', '김치전', '해물파전', '떡갈비', '오코노미야끼', '카츠샌도', '후토마끼', '오무라이스'],
    '유제품': ['까르보나라 파스타', '로제파스타', '피자'],
    '견과류': ['한정식'],
    '갑각류': ['양념게장', '간장게장', '해물 전골', '해물탕', '꽃게탕', '아구찜', '해물찜', '짬뽕', '훠궈'],
    '육류': ['불고기', '제육볶음', '돼지갈비', '닭갈비', '오리고기', '막창', '곱창', '대창', '찜닭', '매운찜닭', '로제찜닭', '낙곱새', '곱창전골', '불고기 전골', '삼계탕', '갈비찜', '육개장', '감자탕', '순대', '튀김', '양꼬치', '햄버거', '샌드위치', '스테이크', '덮밥', '돈까스', '소불고기', '양고기', '돼지국밥', '설렁탕', '닭발', '불족발', '간장치킨', '삼겹살', '닭볶음탕', '닭칼국수', '갈비탕', '부대찌개', '선지국', '오리훈제', '매운등갈비', '도가니탕', '폭립','소갈비찜','소고기'],
    '생선': ['생선구이', '생선조림', '아구찜', '회', '물회', '고등어구이', '고등어조림', '갈치조림', '알탕', '동태찌개', '장어덮밥', '연어덮밥', '알밥', '연어포케', '추어탕', '뽈찜', '굴비구이', '황태국', '갈치구이', '장어덮밥', '후토마끼'],
    '콩': ['된장찌개', '청국장', '두부김치', '비지찌개','콩국수'],
    '밀가루': ['까르보나라 파스타', '로제파스타', '칼국수', '냉면', '비빔냉면', '밀면', '잔치국수', '쫄면', '짜장면', '중국식볶음밥', '파스타', '라멘', '우동', '스키야키/샤브샤브', '타코', '탕수육', '깐풍기', '튀김', '돈까스', '브리또', '샌드위치', '햄버거', '토스트', '떡볶이', '로제떡볶이', '오뎅', '유부초밥', '콩국수', '마제소바', '부대찌개', '텐동', '열무국수', '오코노미야끼', '마라샹궈', '오무라이스', '스파게티', '뇨끼','알리올리오']
}

# 식단 관련 정보
diet_types = {
    '비건': ['샐러드', '김밥(야채)', '비빔밥(야채)', '나시고랭(야채)', '백반', '두부조림', '두부 샐러드', '퀴노아 샐러드', '비건 버거', '비건 파스타', '두부김치', '비지찌개', '반미', '버섯전골'],
    '할랄': [ '닭칼국수','비빔밥', '한정식', '죽', '도시락', '칼국수', '냉면', '비빔냉면', '밀면', '잔치국수', '오리고기', '치킨', '낙곱새', '해물 전골', '불고기 전골', '쭈꾸미볶음', '낙지볶음', '된장찌개', '삼계탕', '육개장', '떡국', '해물탕', '청국장', '감자탕', '떡볶이', '튀김', '쫄면', '오뎅', '김밥', '양념게장', '간장게장', '생선구이', '생선조림', '아구찜', '생선', '육회', '회', '물회', '짜장면', '중국식볶음밥', '마파두부', '딤섬', '마라탕', '훠궈', '양꼬치', '샌드위치', '토스트', '브리또', '파스타', '로제파스타', '까르보나라 파스타', '스파게티', '알리올리오', '샐러드', '스테이크', '초밥/스시', '메밀소바', '우동', '스키야키/샤브샤브', '카레', '쌀국수', '난', '똠양꿍', '팟타이', '나시고랭', '미고랭', '타코', '탕수육', '깐풍기', '파전', '김치전', '해물파전', '콩나물국밥', '오징어볶음', '육회비빔밥', '양장피', '유산슬', '양고기', '막국수', '해물찜', '순두부찌개', '매운탕', '꽃게탕', '미역국', '곰탕', '설렁탕', '간장치킨', '소불고기', '갈치조림', '고등어조림', '갈치구이', '고등어구이', '김치찜', '소갈비찜', '장어구이', '조개구이', '닭볶음탕', '갈비탕', '비지찌개', '열무국수', '오리훈제', '황태국', '오코노미야끼', '뇨끼'],
    '다이어트': ['샐러드', '나물반찬', '구운 생선', '미역국', '메밀소바', '쌀국수', '비빔밥', '샌드위치', '브리또', '도시락', '샤브샤브', '두부김치', '포케', '연어포케', '죽', '한정식', '나물밥', '된장찌개', '해물탕', '청국장', '콩나물국밥', '알밥', '굴비구이', '황태국', '반미', '분짜', '버섯전골', '파스타' ]
}

# 매운 음식 선호도
spicy_foods = {
    '매운 거 잘 먹는 사람': ['김치전', '비빔냉면', '매운찜닭', '낙곱새', '쭈꾸미볶음', '낙지볶음', '김치찌개', '떡볶이', '김치볶음밥', '매운탕', '꽃게탕', '닭볶음탕', '마파두부', '육개장', '순두부찌개', '짬뽕', '마라탕', '훠궈', '닭발', '불족발', '해물찜', '닭갈비', '동태찌개', '선지국', '두부김치', '매운등갈비', '뽈찜', '마라샹궈', '로제떡볶이', '제육볶음', '깐풍기','양념게장'],
    '매운 거 못 먹는 사람': ['간장게장', '간장치킨', '갈비찜', '갈비탕', '갈치구이', '갈치조림', '감자탕', '고등어구이', '고등어조림', '곰탕', '곱창', '곱창전골', '구이', '굴비구이', '김밥', '김치볶음밥', '김치전', '김치찌개', '김치찜', '까르보나라 파스타', '꽃게탕', '나시고랭', '낙곱새', '낙지볶음', '난', '냉면', '뇨끼', '닭갈비', '닭볶음탕', '닭칼국수', '대창', '덮밥', '도가니탕', '도시락', '돈까스', '동태찌개', '돼지갈비', '돼지국밥', '된장찌개', '두부김치', '딤섬', '떡갈비', '떡국', '떡만두국', '떡볶이', '똠양꿍', '라멘', '로제떡볶이', '로제찜닭', '로제파스타', '리조또', '마제소바', '마파두부', '막국수', '막창', '매운탕', '메밀소바', '물회', '미고랭', '미역국', '밀면', '반미', '반쎄오', '보쌈', '부대찌개', '분짜', '불고기', '불고기 전골', '브리또', '비빔냉면', '비빔밥', '비지찌개', '산낙지', '삼겹살', '삼계탕', '샌드위치', '샐러드', '생선', '생선구이', '생선조림', '선지국', '설렁탕', '소갈비찜', '소고기', '소불고기', '순대', '순대국밥', '순두부찌개', '스키야키/샤브샤브', '스테이크', '스파게티', '쌀국수', '아구찜', '알리올리오', '알밥', '양고기', '양꼬치', '양장피', '연어덮밥', '연어포케', '열무국수', '오뎅', '오리고기', '오리훈제', '오무라이스', '오징어볶음', '오코노미야끼', '우동', '유부초밥', '유산슬', '육개장', '육회', '육회비빔밥', '잔치국수', '장어구이', '장어덮밥', '제육볶음', '조개구이', '족발', '죽', '중국식볶음밥', '짜장면', '쫄면', '쭈꾸미볶음', '찜닭', '청국장', '초밥/스시', '추어탕', '치킨', '카레', '카츠샌도', '칼국수', '콩나물국밥', '타코', '탕수육', '토스트', '튀김', '파스타', '파전', '팟타이', '포케', '폭립', '피자', '필라프', '한정식', '해물 전골', '해물탕', '해물파전', '햄버거', '황태국', '회', '후토마끼', '훠궈','필라프']
}

def calculate_group_preference(users, food):
    total_preference = 0
    max_preference = 0
    for user in users:
        user_preference = 0
        user_max_preference = 0
        for category, foods in food_categories.items():
            if food in foods:
                weight = user['PreferenceFood'].get(category, 0)
                if category in ['koreanFood', 'japaneseFood', 'chineseFood', 'westernFood', 'southeastAsianFood']:
                    user_preference += weight * 1.5
                    user_max_preference += 1.5
                else:
                    user_preference += weight
                    user_max_preference += 1
        total_preference += user_preference
        max_preference += user_max_preference
    return round((total_preference / max_preference) * 100, 1) if max_preference > 0 else 0

def calculate_category_preference(users, food, category):
    total_preference = 0
    max_preference = 0
    for user in users:
        if food in food_categories.get(category, []):
            total_preference += user['PreferenceFood'].get(category, 0)
        max_preference += 1  # 각 사용자마다 최대 1점
    return round((total_preference / max_preference) * 100, 1) if max_preference > 0 else 0

def get_food_category(food):
    for category, foods in food_categories.items():
        if food in foods:
            return category
    return 'unknown'

@app.route('/recommend', methods=['POST'])
def recommend_food():
    user_preferences = request.get_json()  # 이미 파이썬 딕셔너리로 변환됨
    users = list(user_preferences.values())

    # 사용자 식단 유형 확인
    has_vegan = any('비건' == user.get('foodType', '') for user in users)
    has_halal = any('할랄' == user.get('foodType', '') for user in users)
    has_diet = any('다이어트' == user.get('foodType', '') for user in users)

    # 식단 유형에 따른 후보 음식 선정
    if has_vegan:
        candidate_foods = set(diet_types['비건'])
    elif has_halal:
        candidate_foods = set(diet_types['할랄'])
    elif has_diet:
        candidate_foods = set(diet_types['다이어트'])
    else:
        candidate_foods = set(all_foods)

    # 사용자별로 개별적으로 필터링
    user_candidate_foods = []
    for user in users:
        user_foods = set(candidate_foods)
        for exceptional in user['exceptionalFood']:
            if exceptional in exceptional_foods:
                user_foods -= set(exceptional_foods[exceptional])
        if not user['spicyType']:
            user_foods -= set(spicy_foods['매운 거 잘 먹는 사람'])

        # yesterdayFood를 포함하는 음식 제외
        if user['yesterdayFood']:
            user_foods = {food for food in user_foods if user['yesterdayFood'] not in food}

            # '로제', '크림', '스파게티', '파스타' 키워드 처리
            if '로제' in user['yesterdayFood']:
                user_foods = {food for food in user_foods if '로제' not in food}
            if '크림' in user['yesterdayFood']:
                user_foods = {food for food in user_foods if '크림' not in food}
            if '스파게티' in user['yesterdayFood'] or '파스타' in user['yesterdayFood'] or '알리올리오' in user['yesterdayFood']:
                user_foods = {food for food in user_foods if '스파게티' not in food and '파스타' not in food and '알리올리오' not in food}

        user_candidate_foods.append(user_foods)

    # 모든 사용자에 대해 공통된 음식 찾기
    if user_candidate_foods:
        common_foods = set.intersection(*user_candidate_foods)
    else:
        common_foods = set()
    # 음식별 그룹 선호도 계산
    group_preferences = {}
    for food in common_foods:
        group_preferences[food] = calculate_group_preference(users, food)

    # 그룹 선호도가 높은 순서대로 상위 3개 음식 선택
    recommended = []
    sorted_foods = sorted(group_preferences.items(), key=lambda x: x[1], reverse=True)

    for i, (food, preference) in enumerate(sorted_foods[:3], 1):
        food_data = {"foodname": food, "group_preference": preference}

        # 각 음식의 카테고리별 선호도 추가
        food_category = get_food_category(food)
        if food_category in ['koreanFood', 'japaneseFood', 'chineseFood', 'westernFood', 'southeastAsianFood']:
            food_data[f"{food_category}_group_preference"] = calculate_category_preference(users, food, food_category)

        category_groups = [
            ["meat", "seafood", "vegetable", "carbohydrate"],
            ["rice", "bread", "noodle"],
            ["heavy", "light"],
            ["soup", "noSoup"],
            ["redFood", "nonRedFood"]
        ]

        category_preferences = []
        for group in category_groups:
            for cat in group:
                if food in food_categories.get(cat, []):
                    category_preferences.append((cat, calculate_category_preference(users, food, cat)))
        # 상위 5개의 퍼센티지만 반환
        category_preferences = sorted(category_preferences, key=lambda x: x[1], reverse=True)[:5]
        if len(category_preferences) < 5:
            additional_preferences = sorted(group_preferences.items(), key=lambda x: x[1], reverse=True)
            for j, (additional_food, additional_preference) in enumerate(additional_preferences):
                if len(category_preferences) < 5:
                    category_preferences.append((f"{j}_preference", additional_preference))
                else:
                    break
        for cat, pref in category_preferences:
            food_data[f"{cat}_preference"] = pref

        recommended.append(food_data)

    return jsonify(recommended)

if __name__ == '__main__':
    app.run(host='0.0.0.0', port=5000)
    for group in category_groups:
        found = False
    for cat in group:
        if food in food_categories.get(cat, []):
            food_data[f"{cat}_preference"] = calculate_category_preference(users, food, cat)
            found = True
            break
    if not found:
        for cat in group:
            food_data[f"{cat}_preference"] = 0